In [8]:
import pandas as pd

In [16]:
df=pd.read_csv(r"C:\Users\sirig\Downloads\data.csv")
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [17]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [18]:
df.columns

Index(['Date', 'Category', 'Value', 'Product', 'Sales', 'Region'], dtype='object')

In [19]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
type(df.dtypes)

pandas.core.series.Series

In [24]:
dy=df.dtypes

In [25]:
dy['Product']

dtype('O')

In [26]:
dy

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [28]:
df['Category'][5:10]
#negatives indexes will work in list but not in series thats the difference between series and list

5    B
6    A
7    C
8    C
9    A
Name: Category, dtype: object

In [31]:
df['Category'][::2]

0     A
2     C
4     B
6     A
8     C
10    B
12    A
14    A
16    C
18    A
20    C
22    B
24    A
26    C
28    B
30    B
32    B
34    C
36    C
38    C
40    B
42    A
44    A
46    B
48    C
Name: Category, dtype: object

In [32]:
list(df['Category'][::2])

['A',
 'C',
 'B',
 'A',
 'C',
 'B',
 'A',
 'A',
 'C',
 'A',
 'C',
 'B',
 'A',
 'C',
 'B',
 'B',
 'B',
 'C',
 'C',
 'C',
 'B',
 'A',
 'A',
 'B',
 'C']

In [33]:
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [36]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [37]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [40]:
df.dtypes[df.dtypes=='object']

Date        object
Category    object
Product     object
Region      object
dtype: object

In [42]:
df.dtypes[df.dtypes=='object'].index

Index(['Date', 'Category', 'Product', 'Region'], dtype='object')

In [44]:
df_obj=df[df.dtypes[df.dtypes=='object'].index]

In [45]:
df_obj.describe()

              Date Category   Product Region
count           50       50        50     50
unique          50        3         3      4
top     2023-01-01        C  Product3   West
freq             1       21        19     18

In [46]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [54]:
import numpy as np
nullvalueindexes =np.where(df['Value'].isnull()==True)
#togetthe indexes where null values are present

In [64]:
df[df['Value'].isnull()==True]

          Date Category  Value   Product  Sales Region
15  2023-01-16        C    NaN  Product1  895.0  North
17  2023-01-18        C    NaN  Product1  108.0   West
28  2023-01-29        B    NaN  Product3  617.0  North

In [65]:
df.iloc[nullvalueindexes]

          Date Category  Value   Product  Sales Region
15  2023-01-16        C    NaN  Product1  895.0  North
17  2023-01-18        C    NaN  Product1  108.0   West
28  2023-01-29        B    NaN  Product3  617.0  North

In [66]:
df.iloc[15]

Date        2023-01-16
Category             C
Value              NaN
Product       Product1
Sales            895.0
Region           North
Name: 15, dtype: object

In [67]:
df.iloc[[15,17,28]]

          Date Category  Value   Product  Sales Region
15  2023-01-16        C    NaN  Product1  895.0  North
17  2023-01-18        C    NaN  Product1  108.0   West
28  2023-01-29        B    NaN  Product3  617.0  North

In [68]:
df["new column"]='Rakesh'

In [70]:
df.head()

         Date Category  Value   Product  Sales Region new column
0  2023-01-01        A   28.0  Product1  754.0   East     Rakesh
1  2023-01-02        B   39.0  Product3  110.0  North     Rakesh
2  2023-01-03        C   32.0  Product2  398.0   East     Rakesh
3  2023-01-04        B    8.0  Product1  522.0   East     Rakesh
4  2023-01-05        B   26.0  Product3  869.0  North     Rakesh

In [71]:
l=[1,2,3,4,5]
pd.Series(l)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [74]:
d={'key':'rakesh','title':'hero','mail_id':'rakesh@gmail.com'}
pd.DataFrame(d,index=['key','title','mail_id'])

            key title           mail_id
key      rakesh  hero  rakesh@gmail.com
title    rakesh  hero  rakesh@gmail.com
mail_id  rakesh  hero  rakesh@gmail.com

In [75]:
pd.Series(d)

key                  rakesh
title                  hero
mail_id    rakesh@gmail.com
dtype: object

In [84]:
a=pd.DataFrame(np.random.randn(3,4).reshape(3,4),index=['22','32','44'])

In [91]:
#to access Values with default indexes you should use iloc if you want to access indexes which you namedyou can use loc
print(a.loc['44'], a.iloc[2])

0    0.006257
1   -0.281395
2   -1.190758
3    0.759945
Name: 44, dtype: float64 0    0.006257
1   -0.281395
2   -1.190758
3    0.759945
Name: 44, dtype: float64

In [96]:

df2=pd.DataFrame(np.random.randint(5,15,(4,5)),index=['a','b','c','d'],columns=['v','w','x','y','z'])

In [97]:
df2

    v   w   x   y   z
a  13  10  14   7   6
b   8   6  12  11  12
c   5  11  12   9   5
d   7  14   9   5  11

In [100]:
df2.loc['c':,'x':]

    x  y   z
c  12  9   5
d   9  5  11

In [101]:
df2.iloc[2:,2:4]

    x  y
c  12  9
d   9  5

In [102]:
df2['new']=df2['w']+df2.x

In [103]:
df2

    v   w   x   y   z  new
a  13  10  14   7   6   24
b   8   6  12  11  12   18
c   5  11  12   9   5   23
d   7  14   9   5  11   23

In [109]:
df2.drop('new', axis=1)
#axis=0 is row,axis=1 is column

    v   w   x   y   z
a  13  10  14   7   6
b   8   6  12  11  12
c   5  11  12   9   5
d   7  14   9   5  11

In [111]:
df2
#drop wont permanently delete the column, to delete it permanently u have to use inplace along with drop

    v   w   x   y   z  new
a  13  10  14   7   6   24
b   8   6  12  11  12   18
c   5  11  12   9   5   23
d   7  14   9   5  11   23

In [112]:
df2.drop('new',axis=1,inplace=True)

In [113]:
df2

    v   w   x   y   z
a  13  10  14   7   6
b   8   6  12  11  12
c   5  11  12   9   5
d   7  14   9   5  11

In [116]:
#to get the same random data as our colleagues while using random we will use seed
np.random.seed(23)
df3= pd.DataFrame(np.random.randn(4,5),index=['a','b','c','d'],columns=['v','w','x','y','z'])

In [117]:
df3

          v         w         x         y         z
a  0.666988  0.025813 -0.777619  0.948634  0.701672
b -1.051082 -0.367548 -1.137460 -1.322148  1.772258
c -0.347459  0.670140  0.322272  0.060343 -1.043450
d -1.009942  0.441736  1.128877 -1.838068 -0.938769

In [164]:
df3.values[df3.values <0]

array([-0.77761941, -1.05108156, -0.36754812, -1.13745969, -1.32214752,
       -0.34745899, -1.04345   , -1.00994188, -1.83806777, -0.93876863])

In [165]:
for i in df3.index:
  for j in df3.columns:
    if df3.loc[i][j]<0:
      print(i,j,df3.loc[i][j])

a x -0.7776194131918178
b v -1.0510815639071178
b w -0.3675481161171661
b x -1.1374596907250272
b y -1.3221475225908594
c v -0.34745899102186334
c z -1.0434500017467254
d v -1.0099418765878465
d y -1.8380677677579502
d z -0.9387686311201282

In [166]:
#df3.dropna(axis=0) will drop the row Even if single null value is presentThe Axis is 0 it will dropthe
#  row if the axis  is one it will drop the column
#df3.dropna(thresh=3) will drop all the rows which doesnt have minimum 3 non null values if axis=0 and columns if axis=1
#df.fillna(567) will all null values with 567
#df.fillna(value=df['key'].mean()) will replace all null with mean value of key1

In [167]:
df.head(10)

         Date Category  Value   Product  Sales Region new column
0  2023-01-01        A   28.0  Product1  754.0   East     Rakesh
1  2023-01-02        B   39.0  Product3  110.0  North     Rakesh
2  2023-01-03        C   32.0  Product2  398.0   East     Rakesh
3  2023-01-04        B    8.0  Product1  522.0   East     Rakesh
4  2023-01-05        B   26.0  Product3  869.0  North     Rakesh
5  2023-01-06        B   54.0  Product3  192.0   West     Rakesh
6  2023-01-07        A   16.0  Product1  936.0   East     Rakesh
7  2023-01-08        C   89.0  Product1  488.0   West     Rakesh
8  2023-01-09        C   37.0  Product3  772.0   West     Rakesh
9  2023-01-10        A   22.0  Product2  834.0   West     Rakesh

In [177]:
df.groupby('Value').sum().head(5)

             Date Category   Product  Sales Region new column
Value
2.0    2023-02-07        C  Product1    0.0  North     Rakesh
6.0    2023-02-16        B  Product1  938.0  South     Rakesh
7.0    2023-01-11        B  Product1  842.0  North     Rakesh
8.0    2023-01-04        B  Product1  522.0   East     Rakesh
11.0   2023-02-19        C  Product3  708.0  North     Rakesh

In [178]:
df3

          v         w         x         y         z
a  0.666988  0.025813 -0.777619  0.948634  0.701672
b -1.051082 -0.367548 -1.137460 -1.322148  1.772258
c -0.347459  0.670140  0.322272  0.060343 -1.043450
d -1.009942  0.441736  1.128877 -1.838068 -0.938769

In [179]:
df3.T

          a         b         c         d
v  0.666988 -1.051082 -0.347459 -1.009942
w  0.025813 -0.367548  0.670140  0.441736
x -0.777619 -1.137460  0.322272  1.128877
y  0.948634 -1.322148  0.060343 -1.838068
z  0.701672  1.772258 -1.043450 -0.938769

In [180]:
df3

          v         w         x         y         z
a  0.666988  0.025813 -0.777619  0.948634  0.701672
b -1.051082 -0.367548 -1.137460 -1.322148  1.772258
c -0.347459  0.670140  0.322272  0.060343 -1.043450
d -1.009942  0.441736  1.128877 -1.838068 -0.938769

In [181]:
left=pd.DataFrame({'key':['k0','K8','K2','K3'],'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key':['k0','K1','K2','K3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [182]:
left

  key   A   B
0  k0  A0  B0
1  K8  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [183]:
right

  key   C   D
0  k0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [185]:
pd.merge(left,right,on='key') #defaultinnermerge

  key   A   B   C   D
0  k0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [187]:
pd.merge(left,right,on='key',how='left')

  key   A   B    C    D
0  k0  A0  B0   C0   D0
1  K8  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [188]:
pd.merge(left,right,on='key',how='right')

  key    A    B   C   D
0  k0   A0   B0  C0  D0
1  K1  NaN  NaN  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3

In [189]:
pd.merge(left,right,on='key',how='outer')

  key    A    B    C    D
0  K1  NaN  NaN   C1   D1
1  K2   A2   B2   C2   D2
2  K3   A3   B3   C3   D3
3  K8   A1   B1  NaN  NaN
4  k0   A0   B0   C0   D0